## Обработка матричных данных

Простая программа для чтения и обработки матричных данных из
стандартного ввода

### Структура проекта
```
project_dataread/
├── [check.py] # Основной исполняемый файл
├── input.txt # Тестовые входные данные
├── output.txt # Файл с выводом и временными метками
└── README.md # Файл с документацией и инструкциями
```
### Файлы и их назначение

#### check.py

##### Описание работы:

- **На входе:** Первая строка - целое число N, затем N строк данных
- **На выходе:**
  - На экран: список строк `['строка1', 'строка2', ...]`
  - В файл output.txt: дата-время и результат выполнения

**Переменные и их типы:**

- `elements_count: int` - количество строк для чтения
- `data: list[str]` - список прочитанных строк данных
- `timestamp: str` - строка с датой и временем выполнения

**Используемые модули и функции:**

- `datetime` - модуль для работы с датой и временем
- `sys` - модуль для работы с системными функциями
- `sys.stdin.readline()` - быстрое чтение из стандартного ввода
- `rstrip()` - удаление пробелов и переводов строк справа
- `datetime.now()` - получение текущей даты и времени
- `strftime()` - форматирование даты в строку
- `open()` - открытие файла для записи
- `write()` - запись данных в файл
- `print()` - выводит данные на экран

**Конструкции:**

- `for _ in` - цикл для повторения N раз
- `with open() as f:` - менеджер контекста для работы с файлами
- List comprehension `[sys.stdin.readline().rstrip() for _ in range(elements_count)]` - создание списка входных данных

**Особенности:**

- Используется кодировка UTF-8 для корректной работы с русским текстом
- Файл output.txt открывается в режиме добавления ('a')
- Использует `sys.stdin.readline()` для более быстрого чтения данных
- Автоматически удаляет лишние пробелы и переводы строк с помощью `sys.stdin.readline()`
- Оптимизировано для работы с большими объемами данных

##### Код:

```
import datetime
import sys

# Чтение входных данных из stdin
elements_count = int(sys.stdin.readline().rstrip())
data = [sys.stdin.readline().rstrip() for _ in range(elements_count)]

# Запись в файл с временными метками
with open('output.txt', 'a', encoding='utf-8') as f:
    timestamp = datetime.datetime.now().strftime("%Y-%m-%d %H:%M:%S")
    f.write(f"{timestamp}\n")
    f.write(f"{data}\n")
    f.write("\n")  # пустая строка для разделения запусков

# Вывод на экран
print(data)
```

#### input.txt

Файл с тестовыми данными. Формат:

* Первая строка: число N (количество строк)
* Следующие N строк: данные матрицы

**Пример содержимого:**

**text**

```
5
1 2 3 4 5
6 7 8 9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25
```

#### output.txt

Файл с результатами выполнения программы. Формат:

* Первая строка: дата и время выполнения в формате `ГГГГ-ММ-ДД ЧЧ:ММ:СС`
* Вторая строка: результат выполнения в формате списка строк `['строка1', 'строка2', ...]`
* Третья строка: пустая строка (разделитель между запусками)

**Пример содержимого:**

**text**

```
2024-09-04 15:30:25
['1 2 3 4 5', '6 7 8 9 10', '11 12 13 14 15', '16 17 18 19 20', '21 22 23 24 25']
```

## Использование

### Запуск с чтением из файла

**bash**

```
python check.py < input.txt
```

### Запуск с ручным вводом данных

**bash**

```
python check.py
```

## Пример

### Входные данные (input.txt):

**text**

```
5
1 2 3 4 5
6 7 8 9 10
11 12 13 14 15
16 17 18 19 20
21 22 23 24 25
```

### Ожидаемый вывод (output.txt):

**text**

```
['1 2 3 4 5', '6 7 8 9 10', '11 12 13 14 15', '16 17 18 19 20', '21 22 23 24 25']
```

## Тестирование скорости работы

Для измерения времени выполнения программы:

**bash**

```
time python check.py < input.txt
```

**Пример вывода:**

**text**

```
['1 2 3 4 5', '6 7 8 9 10', '11 12 13 14 15', '16 17 18 19 20', '21 22 23 24 25']

real    0m0,177s
user    0m0,062s
sys     0m0,045s
```

**Расшифровка метрик:**

* `real` - общее реальное время выполнения (0.177 секунды)
* `user` - время выполнения в пользовательском режиме (0.062 секунды)
* `sys` - время выполнения в режиме ядра (0.045 секунды)

## Требования

* Python 3.6+

## Автор

Ямщикова Татьяна @tat28mar
